000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КодыТоваровSKU/КодыТоваровSKU.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КодыТоваровSKU</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>SKU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDNG</name>
    <comment>IDN группы. Служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEB_АвторепрайсЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_Выгружать</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_МониторингЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <comment>Использовать серийные номера (подарочные сертификаты)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоУКТЗЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маржинальность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТовара</name>
    <type>
      <types>EnumRef.НазначенияТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовинкаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксклюзив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КодыТоваровSKU/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ  
                       
//Функци производит проверки при окончании ввода текста в поле "Код"
//Параметры - НовыйSKU - Число, введенный пользователем SKU
//Возвращаемое значение - Структура с описанием действий на клиенте
&НаСервере    
Функция ОбработатьИзменениеSKU(НовыйSKU)
	
	СписокСвободныхSKU.Очистить(); 
	СтруктураДействий = Новый Структура;
	
	Если НовыйSKU < НижняяГраницаДиапазонаSKUВесовогоТовара ИЛИ НовыйSKU > ВерхняяГраницаДиапазонаSKUВесовогоТовара Тогда
		Запись.SKU = ИсходныйSKU;
		СтруктураДействий.Вставить("ОповещениеПользователю", НСтр("ru = 'Значение SKU не в выбранном диапазоне, перемещение невозможно'"));
	Иначе
		СвободныеSKU = РегистрыСведений.КодыТоваровSKU.ПолучитьСвободныеSKUМетодомОбъединения(НовыйSKU, НовыйSKU);
		Если СвободныеSKU.Количество() = 0 Тогда
			Запись.SKU = ИсходныйSKU;
			СтруктураДействий.Вставить("ОповещениеПользователю", НСтр("ru = 'Выбранный SKU занят, перемещение невозможно'"));
		Иначе
			Запись.SKU = НовыйSKU;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураДействий;
	
КонецФункции

//Формирует список свободных SKU при использовании кнопки выбора поля "Кода"
//
&НаСервере
Процедура СформироватьСписокСвободныхSKU()
	
	СписокСвободныхSKU.Очистить();
	
	НовыйSKU = Запись.SKU;
	
	Верх = ВерхняяГраницаДиапазонаSKUВесовогоТовара - 1;
	Низ  = НижняяГраницаДиапазонаSKUВесовогоТовара  + 1;
	
	СвободныеSKU = РегистрыСведений.КодыТоваровSKU.ПолучитьСвободныеSKUМетодомОбъединения(Низ, Верх);
	КоличествоСвободныхSKU = СвободныеSKU.Итог("КоличествоСвободныхSKU");
		
	Итератор = 0;
	
	Пока Итератор < СвободныеSKU.Количество() Цикл
		Если СвободныеSKU[Итератор].SKU <> НижняяГраницаДиапазонаSKUВесовогоТовара Тогда
			ЭлементСписка = СписокСвободныхSKU.Добавить(СвободныеSKU[Итератор].SKU);
			
			Если ЭлементСписка.Значение > НовыйSKU Тогда
				НачальноеЗначение = ЭлементСписка;
			КонецЕсли;
			
			Если СписокСвободныхSKU.Количество() >= 100 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СвободныеSKU[Итератор].SKU = СвободныеSKU[Итератор].КонецИнтервала Тогда
			Итератор = Итератор + 1;
		Иначе
			СвободныеSKU[Итератор].SKU = СвободныеSKU[Итератор].SKU + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	СписокСвободныхSKU.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	Если НачальноеЗначение = 0 Тогда
		НачальноеЗначение = СписокСвободныхSKU.Получить(СписокСвободныхSKU.Количество()-1);
	КонецЕсли;
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	   
	ИсходныйSKU                       = Запись.SKU;
	ВерхняяГраницаДиапазонаSKUВесовогоТовара   = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВерхняяГраницаДиапазонаSKUВесовогоТовара");
	НижняяГраницаДиапазонаSKUВесовогоТовара    = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("НижняяГраницаДиапазонаSKUВесовогоТовара");
	
КонецПроцедуры

//Процедура - обработчик события "ПриЗаписиНаСервере" формы
//
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИсходныйSKU <> ТекущийОбъект.SKU И ТекущийОбъект.SKU >= НижняяГраницаДиапазонаSKUВесовогоТовара Тогда
		SKU                = РегистрыСведений.КодыТоваровSKU.СоздатьМенеджерЗаписи();
		SKU.SKU            = ИсходныйSKU;
		SKU.Номенклатура   = Справочники.Номенклатура.ПустаяСсылка();
		SKU.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		SKU.Упаковка       = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
		SKU.Записать();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

//Процедура - обработчик события "НачалоВыбораИзСписка" поля "SKU"
//
&НаКлиенте
Процедура SKUНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СформироватьСписокСвободныхSKU();
	
	СтароеЗначение = Запись.SKU;
	
	ВыбранноеЗначение = ВыбратьИзСписка(СписокСвободныхSKU, Элемент, НачальноеЗначение);
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Запись.SKU = ВыбранноеЗначение.Значение;
	Иначе
		Запись.SKU = СтароеЗначение;
	КонецЕсли;

КонецПроцедуры

//Процедура - обработчик события "ОкончаниеВводаТекста" поля "SKU"
//
&НаКлиенте
Процедура SKUОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураДействий = ОбработатьИзменениеSKU(Число(Текст));
	
	Если СтруктураДействий.Свойство("ОповещениеПользователю") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДействий.ОповещениеПользователю,,"Запись.SKU");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ВыбратьИзСписка") Тогда
		ВыбранноеЗначение = ВыбратьИзСписка(СписокСвободныхSKU, Элемент, НачальноеЗначение);
		Если ВыбранноеЗначение = Неопределено Тогда
			Запись.SKU = ИсходныйSKU;
		Иначе
			Запись.SKU = ВыбранноеЗначение.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
